{
  "stores": [
    {
      "id": 1,
      "name": "Park Row at Beekman St",
      "address": "38 Park Row",
      "city": "New York",
      "openingHours": "10:00 - 14:00 and 17:00 - 20:30"
    },
    {
      "id": 2,
      "name": "Store Alcalá",
      "address": "Calle de Alcalá, 21",
      "city": "Madrid",
      "openingHours": "10:00 - 14:00 and 17:00 - 20:30"
    },
    {
      "id": 3,
      "name": "Chambers and West Broadway",
      "address": "125 Chambers Street",
      "city": "New York",
      "openingHours": "10:00 - 14:00 and 17:00 - 20:30"
    },
    {
      "id": 4,
      "name": "Covent Garden - Russell St",
      "address": "10 Russell Street",
      "city": "London",
      "openingHours": "10:00 - 14:00 and 17:00 - 20:30"
    },
    {
      "id": 5,
      "name": "Monmouth St",
      "address": "11 Monmouth Street",
      "city": "London",
      "openingHours": "10:00 - 14:00 and 17:00 - 20:30"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Books"
    },
    {
      "id": 2,
      "name": "Electronics"
    },
    {
      "id": 3,
      "name": "Computers"
    }
  ],
  "projects": [
    {
      "id": "eloy_02",
      "name": "Colegas",
      "director": "Eloy de la Iglesia",
      "star": "José Luis Manzano",
      "year": "1982",
      "description": "Una rara avis dentro de la filmografía quinqui, y quizás por eso mismo una de las mejores películas del filón. Nos cuenta las peripecias de tres jóvenes (Manzano, Antonio y Rosario Flores) en la que José (interpretado por Manzano) deja embarazada a Rosario y entre los tres intentan buscar dinero para que ella aborte, pero con la gran tasa de paro juvenil de la época solo encuentran oportunidades en la delincuencia y el trapicheo."
    },
    {
      "id": "eloy_03",
      "name": "El pico",
      "director": "Eloy de la Iglesia",
      "star": "José Luis Manzano",
      "year": "1983",
      "description": "Dos jóvenes en el País Vasco, el primero hijo de un Guardia Civil y el segundo hijo de un político abertzale, que se conocen del instituto se inician en el mundo de las drogas hasta verse enganchados a la heroína, lo que les llevará a su perdición."
    },
    {
      "id": "eloy_04",
      "name": "El pico 2",
      "director": "Eloy de la Iglesia",
      "star": "José Luis Manzano",
      "year": "1984",
      "description": "Después del asesinato de un camello y su mujer en el País Vasco; Paco, hijo de un Guardia Civil, tiene que entrar en prisión. Allí conoce los sinsabores de las la vida penitenciaria y cuando por fin, tras la influencia de su padre es devuelto a la libertad, sólo podrá delinquir para seguir consiguiendo droga."
    },
    {
      "id": "eloy_05",
      "name": "La estanquera de vallecas",
      "director": "Eloy de la Iglesia",
      "star": "José Luis Manzano",
      "year": "1987",
      "description": "Otra de las películas raras del director, esta vez desde la comedia. Basada en una obra de teatro, muchos críticos la consideran el ocaso del género quinqui, con una fórmula agotada y explotada. Un hombre maduro y un joven quinqui, entran en un estanco para atracarlo. Lo que en principio parece un golpe sencillo, se complica por la resistencia de la estanquera que se niega a entregarles el dinero."
    },
    {
      "id": "loma_01",
      "name": "Perros callejeros",
      "director": "José Antonio de la Loma",
      "star": "Ángel Fernández Franco",
      "year": "1977",
      "description": "Película que dará origen al filón. Basada en la historia del Vaquilla, que no pudo interpretar la película por encontrarse recluido cuando se iba a rodar. Cuenta la vida de un joven marginal que vive en el barrio de La Bota en Barcelona y que se gana la vida entre atracos y tirones. Entre tanto se enamora de la sobrina de el Esquinao, un gitano que lleva el cotarro en el barrio, y la cual ya está comprometida. El Torete conseguirá seducirla, hecho que el Esquinao no perdonará."
    },
    {
      "id": "loma_02",
      "name": "Perros callejeros II: Busca y captura",
      "director": "José Antonio de la Loma",
      "star": "Ángel Fernández Franco",
      "year": "1979",
      "description": "Tras el éxito retoma y continúa el argumento de la primera película, relatándonos las aventuras del Torete y su banda. Tras el estreno de la película Perros callejeros, el protagonista es acusado de realizar un atraco en una gasolinera, hecho que nunca pudo cometer, por encontrase ese mismo día en Zaragoza visionando la película. El propio director se encargará de aclarar, defender y apadrinar al joven delincuente."
    },
    {
      "id": "loma_03",
      "name": "Los últimos golpes de El Torete",
      "director": "José Antonio de la Loma",
      "star": "Ángel Fernández Franco",
      "year": "1980",
      "description": "El Torete se encuentra con el Vaquilla, interpretado por Bernard Seray, mientras realizan el atraco a un banco. Los viejos amigos emprenden una huida, entre atraco y atraco que no podrá acabar bien. De La Loma vuelve a explotar la fórmula de Perros callejeros, contando las aventuras y desventuras de los jóvenes marginales de Barcelona. Aunque esta tercera entrega es menos creíble, tiene como elemento diferenciador a dos periodistas que van creando una dialéctica sobre las causas y efectos de estos jóvenes barceloneses. "
    },
    {
      "id": "loma_04",
      "name": "Yo, el vaquilla",
      "director": "José Antonio de la Loma",
      "star": "Raul García Losada",
      "year": "1985",
      "description": "De la Loma por fin consigue trabajar con su amigo el Vaquilla. Partiendo de la autobiografía que éste escribió durante sus confinamientos, nos relata la infancia y primeras aventuras y sobre todo desventuras del que sería uno de los jóvenes delincuentes más famosos de España. Sus continuas entradas en reformatorios, sus primeras fechorías al volante con apenas nueve años y sus idas y venidas entre distintos familiares que nunca le prestaron atención, excepto para enseñarle a delinquir. Lo más destacable de la película son algunas imágenes de carácter documental representando el estilo de vida del barrio."
    },
    {
      "id": "loma_05",
      "name": "Perras callejeras",
      "director": "José Antonio de la Loma",
      "star": "Sonia Martínez",
      "year": "1985",
      "description": "Con Perras callejeras De la Loma parece querer darle un vuelco al género, el cual fue acusado de ser tremendamente machista, siempre representado por varones con una alta carga de testosterona y el que las mujeres solo sirven de excusa para exhibir algún cuerpo y satisfacer el “destape” tan aclamado después del franquismo. Protagonizada por tres mujeres, cada una de las cuales con sus vicisitudes, una acaba de salir de la cárcel, otra es drogadicta y la tercera tiene que lidiar con la pobreza y un padre maltratador. Así que nuestras tres protagonistas no ven otra solución que echarse a la calle a buscarse la vida. Esta película parece más un remake de Nunca en horas de clase, que una película propio del género quinqui, en la que las mujeres explotan su condición femenina para conseguir cualquier objetivo. "
    },
    {
      "id": "loma_06",
      "name": "Tres días de libertad",
      "director": "José Antonio de la Loma",
      "star": "Joan Bentallé",
      "year": "1995",
      "description": "Epílogo de la serie en la que de nuevo inspirada en la vida de el Vaquilla, nos muestra uno de los permisos penitenciarios de los que pudo disfrutar, en el que parece que todo el mundo está convencido de su fuga. Aunque tampoco se considere una película de género quinqui, si hay temas recurrentes (la delincuencia, la cárcel, el tráfico de drogas) que están presentes durante toda la película."
    }
  ],
  "orders": [
    {
      "id": 1,
      "name": "Dominicode",
      "date": "01/12/1995",
      "shippingAddress": "Av. de la Granvia de Hospitalet, 115",
      "city": "Barcelona",
      "pickup": true
    }
  ],
  "detailsOrders": [
    {
      "id": 1,
      "orderId": 1,
      "quantity": 10,
      "productName": "Product name"
    }
  ]
}